str_collect = []
for _1 in ['_+', '_-', '']:
    for _2 in ['_+', '_-', '']:
        for _3 in ['_+', '_-', '']:
            for _4 in ['_+', '_-', '']:
                for _5 in ['_+', '_-', '']:
                    for _6 in ['_+', '_-', '']:
                        for _7 in ['_+', '_-', '']:
                            for _8 in ['_+', '_-', '']:
                                str_item = f'1{_1}2{_2}3{_3}4{_4}5{_5}6{_6}7{_7}8{_8}9'
                                # вставляем лишний символ, чтобы рассплитить по нему и сохранить
                                # знак у числа, потом мы сплитим по этому символу и получаем массив сток,
                                # который просто нужно отпарсить в инт и просуммировать
                                k = str_item.split('_')
                                summ = 0
                                for p in k:
                                    summ += int(p)
                                if summ == 100:
                                    str_collect.append(str_item)

print(str_collect)
print(len(str_collect))
